from django.db import models


# Create your models here.
class Category:
    CATEGORY_CHOICES = (
        (u'소프트웨어 개발', (
                (u'웹사이트', u'웹사이트'),
                (u'안드로이드앱', u'안드로이드앱'),
                (u'아이폰앱', u'아이폰'),
                (u'응용프로그래밍', 'u응용프로그래밍'),
                (u'기술지원 / 원격', u'기술지원 / 원격'),
                (u'임베디드', u'임베디드'),
                (u'매크로', u'매크로'),
                (u'PC견적', u'PC견적'),
                (u'IOT', u'IOT'),
                (u'게임', u'게임'),
                (u'기타', u'기타'),
            )
        ),
        (u'디자인', (
                (u'웹디자인', u'웹디자인'),
                (u'로고 / CI&BI', u'로고 / CI&BI'),
                (u'캘리그라피', u'캘리그라피'),
                (u'전단지 / 홍보물', u'전단지 / 홍보물'),
                (u'명함', u'명함'),
                (u'일러스트', u'일러스트'),
                (u'캐리커쳐', u'캐리커쳐'),
                (u'만화 / 웹툰', u'만화 / 웹툰'),
                (u'캐릭터 / 아이콘', u'캐릭터 / 아이콘'),
                (u'패키지', u'패키지'),
                (u'인테리어', u'인테리어'),
                (u'3D', u'3D'),
                (u'PPT', u'PPT'),
                (u'포토샵', u'포토샵'),
                (u'사진촬영', u'사진촬영'),
                (u'누끼작업', u'누끼작업'),
                (u'기타', u'기타'),
            )
        )
    )
